<a href="https://colab.research.google.com/github/ilikemichael/ml1216/blob/main/titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from urllib.request import urlretrieve
url = "https://github.com/Elwing-Chou/ml1216/raw/main/train.csv"
urlretrieve(url, "train.csv")
url = "https://github.com/Elwing-Chou/ml1216/raw/main/test.csv"
urlretrieve(url, "test.csv")

In [2]:
import pandas as pd
train = pd.read_csv("train.csv", encoding="utf-8")
test = pd.read_csv("test.csv", encoding="utf-8")

In [11]:
#pd.concat([train,test])
datas = pd.concat([train,test], axis=0, ignore_index=True)
datas =datas.drop(["PassengerId", "Survived"], axis=1)
datas

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...   NaN         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...   C85         C
2          3                             Heikkinen, Miss. Laina  ...   NaN         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...  C123         S
4          3                           Allen, Mr. William Henry  ...   NaN         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...   NaN         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...  C105         C
1306       3                       Saether, Mr. Simon Sivertsen  ...   NaN         S
1307       3                                Ware, Mr. Frederick  ...   NaN         S
1308       3                           Peter, Master. Michael J  ...   NaN         C

[1309 rows x 10 columns]

In [14]:
s = datas.isna().sum()
#篩選方式:series[跟資料筆數一樣多的True/False]
s[s>0].sort_values(ascending=False)

Cabin       1014
Age          263
Embarked       2
Fare           1
dtype: int64

In [17]:
count = datas["Ticket"].value_counts() 
def share(tn):
    return count[tn]
datas["Ticket"] = datas["Ticket"].apply(share)

CA. 2343           11
CA 2144             8
1601                8
PC 17608            7
S.O.C. 14879        7
                   ..
350042              1
237734              1
370375              1
SC/AH Basle 541     1
330972              1
Name: Ticket, Length: 929, dtype: int64

In [18]:
med = datas.median().drop("Pclass")
med

Age      28.0000
SibSp     0.0000
Parch     0.0000
Fare     14.4542
dtype: float64

In [21]:
datas = datas.fillna(med)
# verify = datas.isna().sum(0)
# verify

Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin       1014
Embarked       2
dtype: int64

In [27]:
#idxmax找到最大值的index
most = datas["Embarked"].value_counts().idxmax()
datas["Embarked"]=datas["Embarked"].fillna(most)
#datas["Embarked"].isna().sum()#確認都已經填滿了

0

In [28]:
def cabin(c):
    if pd.isna(c):
        return None
    else:
        return c[0]
datas["Cabin"] = datas["Cabin"].apply(cabin)

In [29]:
datas

      Pclass                                               Name  ... Cabin  Embarked
0          3                            Braund, Mr. Owen Harris  ...  None         S
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  ...     C         C
2          3                             Heikkinen, Miss. Laina  ...  None         S
3          1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  ...     C         S
4          3                           Allen, Mr. William Henry  ...  None         S
...      ...                                                ...  ...   ...       ...
1304       3                                 Spector, Mr. Woolf  ...  None         S
1305       1                       Oliva y Ocana, Dona. Fermina  ...     C         C
1306       3                       Saether, Mr. Simon Sivertsen  ...  None         S
1307       3                                Ware, Mr. Frederick  ...  None         S
1308       3                           Peter, Master. Michael J  ...  None         C

[1309 rows x 10 columns]